espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: configuration register */
/** Type of bt_select register
 *  GPIO bit select register
 */
typedef union {
    struct {
        /** bt_sel : R/W; bitpos: [31:0]; default: 0;
         *  GPIO bit select register
         */
        uint32_t bt_sel:32;
    };
    uint32_t val;
} gpio_bt_select_reg_t;

/** Type of out register
 *  GPIO output register for GPIO0-30
 */
typedef union {
    struct {
        /** out_data_orig : R/W/SC/WTC; bitpos: [30:0]; default: 0;
         *  GPIO output register for GPIO0-30
         */
        uint32_t out_data_orig:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_out_reg_t;

/** Type of out_w1ts register
 *  GPIO output set register for GPIO0-30
 */
typedef union {
    struct {
        /** out_w1ts : WT; bitpos: [30:0]; default: 0;
         *  GPIO output set register for GPIO0-30
         */
        uint32_t out_w1ts:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_out_w1ts_reg_t;

/** Type of out_w1tc register
 *  GPIO output clear register for GPIO0-30
 */
typedef union {
    struct {
        /** out_w1tc : WT; bitpos: [30:0]; default: 0;
         *  GPIO output clear register for GPIO0-30
         */
        uint32_t out_w1tc:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_out_w1tc_reg_t;

/** Type of sdio_select register
 *  GPIO sdio select register
 */
typedef union {
    struct {
        /** sdio_sel : R/W; bitpos: [7:0]; default: 0;
         *  GPIO sdio select register
         */
        uint32_t sdio_sel:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_sdio_select_reg_t;

/** Type of enable register
 *  GPIO output enable register for GPIO0-30
 */
typedef union {
    struct {
        /** enable_data : R/W/WTC; bitpos: [30:0]; default: 0;
         *  GPIO output enable register for GPIO0-30
         */
        uint32_t enable_data:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_enable_reg_t;

/** Type of enable_w1ts register
 *  GPIO output enable set register for GPIO0-30
 */
typedef union {
    struct {
        /** enable_w1ts : WT; bitpos: [30:0]; default: 0;
         *  GPIO output enable set register for GPIO0-30
         */
        uint32_t enable_w1ts:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_enable_w1ts_reg_t;

/** Type of enable_w1tc register
 *  GPIO output enable clear register for GPIO0-30
 */
typedef union {
    struct {
        /** enable_w1tc : WT; bitpos: [30:0]; default: 0;
         *  GPIO output enable clear register for GPIO0-30
         */
        uint32_t enable_w1tc:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_enable_w1tc_reg_t;

/** Type of strap register
 *  pad strapping register
 */
typedef union {
    struct {
        /** strapping : RO; bitpos: [15:0]; default: 0;
         *  pad strapping register
         */
        uint32_t strapping:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} gpio_strap_reg_t;

/** Type of in register
 *  GPIO input register for GPIO0-30
 */
typedef union {
    struct {
        /** in_data_next : RO; bitpos: [30:0]; default: 0;
         *  GPIO input register for GPIO0-30
         */
        uint32_t in_data_next:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_in_reg_t;

/** Type of status register
 *  GPIO interrupt status register for GPIO0-30
 */
typedef union {
    struct {
        /** status_interrupt : R/W/WTC; bitpos: [30:0]; default: 0;
         *  GPIO interrupt status register for GPIO0-30
         */
        uint32_t status_interrupt:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_status_reg_t;

/** Type of status_w1ts register
 *  GPIO interrupt status set register for GPIO0-30
 */
typedef union {
    struct {
        /** status_w1ts : WT; bitpos: [30:0]; default: 0;
         *  GPIO interrupt status set register for GPIO0-30
         */
        uint32_t status_w1ts:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_status_w1ts_reg_t;

/** Type of status_w1tc register
 *  GPIO interrupt status clear register for GPIO0-30
 */
typedef union {
    struct {
        /** status_w1tc : WT; bitpos: [30:0]; default: 0;
         *  GPIO interrupt status clear register for GPIO0-30
         */
        uint32_t status_w1tc:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_status_w1tc_reg_t;

/** Type of pcpu_int register
 *  GPIO PRO_CPU interrupt status register for GPIO0-30
 */
typedef union {
    struct {
        /** procpu_int : RO; bitpos: [30:0]; default: 0;
         *  GPIO PRO_CPU interrupt status register for GPIO0-30
         */
        uint32_t procpu_int:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_pcpu_int_reg_t;

/** Type of pcpu_nmi_int register
 *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO0-30
 */
typedef union {
    struct {
        /** procpu_nmi_int : RO; bitpos: [30:0]; default: 0;
         *  GPIO PRO_CPU(not shielded) interrupt status register for GPIO0-30
         */
        uint32_t procpu_nmi_int:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_pcpu_nmi_int_reg_t;

/** Type of cpusdio_int register
 *  GPIO CPUSDIO interrupt status register for GPIO0-30
 */
typedef union {
    struct {
        /** sdio_int : RO; bitpos: [30:0]; default: 0;
         *  GPIO CPUSDIO interrupt status register for GPIO0-30
         */
        uint32_t sdio_int:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_cpusdio_int_reg_t;

/** Type of pinn register
 *  GPIO pin configuration register
 */
typedef union {
    struct {
        /** pinn_sync2_bypass : R/W; bitpos: [1:0]; default: 0;
         *  set GPIO input_sync2 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
         *  posedge.
         */
        uint32_t pinn_sync2_bypass:2;
        /** pinn_pad_driver : R/W; bitpos: [2]; default: 0;
         *  set this bit to select pad driver. 1:open-drain. 0:normal.
         */
        uint32_t pinn_pad_driver:1;
        /** pinn_sync1_bypass : R/W; bitpos: [4:3]; default: 0;
         *  set GPIO input_sync1 signal mode. 0:disable. 1:trigger at negedge. 2or3:trigger at
         *  posedge.
         */
        uint32_t pinn_sync1_bypass:2;
        uint32_t reserved_5:2;
        /** pinn_int_type : R/W; bitpos: [9:7]; default: 0;
         *  set this value to choose interrupt mode. 0:disable GPIO interrupt. 1:trigger at
         *  posedge. 2:trigger at negedge. 3:trigger at any edge. 4:valid at low level. 5:valid
         *  at high level
         */
        uint32_t pinn_int_type:3;
        /** pinn_wakeup_enable : R/W; bitpos: [10]; default: 0;
         *  set this bit to enable GPIO wakeup.(can only wakeup CPU from Light-sleep Mode)
         */
        uint32_t pinn_wakeup_enable:1;
        /** pinn_config : R/W; bitpos: [12:11]; default: 0;
         *  reserved
         */
        uint32_t pinn_config:2;
        /** pinn_int_ena : R/W; bitpos: [17:13]; default: 0;
         *  set bit 13 to enable CPU interrupt. set bit 14 to enable CPU(not shielded)
         *  interrupt.
         */
        uint32_t pinn_int_ena:5;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} gpio_pinn_reg_t;

