espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of status_next register
 *  GPIO interrupt source register for GPIO0-31
 */
typedef union {
    struct {
        /** status_interrupt_next : RO; bitpos: [30:0]; default: 0;
         *  GPIO interrupt source register for GPIO0-31
         */
        uint32_t status_interrupt_next:31;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} gpio_status_next_reg_t;

/** Type of func0_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func0_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func0_in_sel:6;
        /** func0_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func0_in_inv_sel:1;
        /** sig0_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig0_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func0_in_sel_cfg_reg_t;

/** Type of func6_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func6_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func6_in_sel:6;
        /** func6_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func6_in_inv_sel:1;
        /** sig6_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig6_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func6_in_sel_cfg_reg_t;

/** Type of func7_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func7_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func7_in_sel:6;
        /** func7_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func7_in_inv_sel:1;
        /** sig7_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig7_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func7_in_sel_cfg_reg_t;

/** Type of func8_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func8_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func8_in_sel:6;
        /** func8_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func8_in_inv_sel:1;
        /** sig8_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig8_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func8_in_sel_cfg_reg_t;

/** Type of func9_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func9_in_sel : R/W; bitpos: [5:0]; default: 56;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func9_in_sel:6;
        /** func9_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func9_in_inv_sel:1;
        /** sig9_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig9_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func9_in_sel_cfg_reg_t;

/** Type of func10_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func10_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func10_in_sel:6;
        /** func10_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func10_in_inv_sel:1;
        /** sig10_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig10_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func10_in_sel_cfg_reg_t;

/** Type of func11_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func11_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func11_in_sel:6;
        /** func11_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func11_in_inv_sel:1;
        /** sig11_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig11_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func11_in_sel_cfg_reg_t;

/** Type of func12_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func12_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func12_in_sel:6;
        /** func12_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func12_in_inv_sel:1;
        /** sig12_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig12_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func12_in_sel_cfg_reg_t;

