espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func34_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func34_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func34_in_sel:6;
        /** func34_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func34_in_inv_sel:1;
        /** sig34_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig34_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func34_in_sel_cfg_reg_t;

/** Type of func35_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func35_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func35_in_sel:6;
        /** func35_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func35_in_inv_sel:1;
        /** sig35_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig35_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func35_in_sel_cfg_reg_t;

/** Type of func40_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func40_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func40_in_sel:6;
        /** func40_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func40_in_inv_sel:1;
        /** sig40_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig40_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func40_in_sel_cfg_reg_t;

/** Type of func41_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func41_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func41_in_sel:6;
        /** func41_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func41_in_inv_sel:1;
        /** sig41_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig41_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func41_in_sel_cfg_reg_t;

/** Type of func42_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func42_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func42_in_sel:6;
        /** func42_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func42_in_inv_sel:1;
        /** sig42_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig42_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func42_in_sel_cfg_reg_t;

/** Type of func45_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func45_in_sel : R/W; bitpos: [5:0]; default: 56;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func45_in_sel:6;
        /** func45_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func45_in_inv_sel:1;
        /** sig45_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig45_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func45_in_sel_cfg_reg_t;

/** Type of func46_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func46_in_sel : R/W; bitpos: [5:0]; default: 56;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func46_in_sel:6;
        /** func46_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func46_in_inv_sel:1;
        /** sig46_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig46_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func46_in_sel_cfg_reg_t;

/** Type of func47_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func47_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func47_in_sel:6;
        /** func47_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func47_in_inv_sel:1;
        /** sig47_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig47_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func47_in_sel_cfg_reg_t;

/** Type of func48_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func48_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func48_in_sel:6;
        /** func48_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func48_in_inv_sel:1;
        /** sig48_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig48_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func48_in_sel_cfg_reg_t;

/** Type of func49_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func49_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func49_in_sel:6;
        /** func49_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func49_in_inv_sel:1;
        /** sig49_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig49_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func49_in_sel_cfg_reg_t;

/** Type of func50_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func50_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func50_in_sel:6;
        /** func50_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func50_in_inv_sel:1;
        /** sig50_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig50_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func50_in_sel_cfg_reg_t;

/** Type of func51_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func51_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func51_in_sel:6;
        /** func51_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func51_in_inv_sel:1;
        /** sig51_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig51_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func51_in_sel_cfg_reg_t;

/** Type of func52_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func52_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func52_in_sel:6;
        /** func52_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func52_in_inv_sel:1;
        /** sig52_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig52_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func52_in_sel_cfg_reg_t;

