espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func53_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func53_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func53_in_sel:6;
        /** func53_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func53_in_inv_sel:1;
        /** sig53_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig53_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func53_in_sel_cfg_reg_t;

/** Type of func54_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func54_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func54_in_sel:6;
        /** func54_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func54_in_inv_sel:1;
        /** sig54_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig54_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func54_in_sel_cfg_reg_t;

/** Type of func63_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func63_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func63_in_sel:6;
        /** func63_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func63_in_inv_sel:1;
        /** sig63_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig63_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func63_in_sel_cfg_reg_t;

/** Type of func64_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func64_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func64_in_sel:6;
        /** func64_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func64_in_inv_sel:1;
        /** sig64_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig64_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func64_in_sel_cfg_reg_t;

/** Type of func65_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func65_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func65_in_sel:6;
        /** func65_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func65_in_inv_sel:1;
        /** sig65_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig65_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func65_in_sel_cfg_reg_t;

/** Type of func66_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func66_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func66_in_sel:6;
        /** func66_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func66_in_inv_sel:1;
        /** sig66_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig66_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func66_in_sel_cfg_reg_t;

/** Type of func67_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func67_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func67_in_sel:6;
        /** func67_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func67_in_inv_sel:1;
        /** sig67_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig67_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func67_in_sel_cfg_reg_t;

/** Type of func68_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func68_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func68_in_sel:6;
        /** func68_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func68_in_inv_sel:1;
        /** sig68_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig68_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func68_in_sel_cfg_reg_t;

/** Type of func69_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func69_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func69_in_sel:6;
        /** func69_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func69_in_inv_sel:1;
        /** sig69_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig69_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func69_in_sel_cfg_reg_t;

/** Type of func70_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func70_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func70_in_sel:6;
        /** func70_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func70_in_inv_sel:1;
        /** sig70_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig70_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func70_in_sel_cfg_reg_t;

/** Type of func71_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func71_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func71_in_sel:6;
        /** func71_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func71_in_inv_sel:1;
        /** sig71_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig71_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func71_in_sel_cfg_reg_t;

/** Type of func72_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func72_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func72_in_sel:6;
        /** func72_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func72_in_inv_sel:1;
        /** sig72_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig72_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func72_in_sel_cfg_reg_t;

