espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func73_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func73_in_sel : R/W; bitpos: [5:0]; default: 56;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func73_in_sel:6;
        /** func73_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func73_in_inv_sel:1;
        /** sig73_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig73_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func73_in_sel_cfg_reg_t;

/** Type of func77_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func77_in_sel : R/W; bitpos: [5:0]; default: 56;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func77_in_sel:6;
        /** func77_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func77_in_inv_sel:1;
        /** sig77_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig77_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func77_in_sel_cfg_reg_t;

/** Type of func81_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func81_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func81_in_sel:6;
        /** func81_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func81_in_inv_sel:1;
        /** sig81_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig81_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func81_in_sel_cfg_reg_t;

/** Type of func82_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func82_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func82_in_sel:6;
        /** func82_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func82_in_inv_sel:1;
        /** sig82_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig82_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func82_in_sel_cfg_reg_t;

/** Type of func83_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func83_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func83_in_sel:6;
        /** func83_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func83_in_inv_sel:1;
        /** sig83_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig83_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func83_in_sel_cfg_reg_t;

/** Type of func84_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func84_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func84_in_sel:6;
        /** func84_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func84_in_inv_sel:1;
        /** sig84_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig84_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func84_in_sel_cfg_reg_t;

/** Type of func85_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func85_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func85_in_sel:6;
        /** func85_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func85_in_inv_sel:1;
        /** sig85_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig85_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func85_in_sel_cfg_reg_t;

/** Type of func86_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func86_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func86_in_sel:6;
        /** func86_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func86_in_inv_sel:1;
        /** sig86_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig86_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func86_in_sel_cfg_reg_t;

/** Type of func87_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func87_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func87_in_sel:6;
        /** func87_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func87_in_inv_sel:1;
        /** sig87_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig87_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func87_in_sel_cfg_reg_t;

/** Type of func88_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func88_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func88_in_sel:6;
        /** func88_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func88_in_inv_sel:1;
        /** sig88_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig88_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func88_in_sel_cfg_reg_t;

/** Type of func89_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func89_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func89_in_sel:6;
        /** func89_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func89_in_inv_sel:1;
        /** sig89_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig89_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func89_in_sel_cfg_reg_t;

/** Type of func90_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func90_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func90_in_sel:6;
        /** func90_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func90_in_inv_sel:1;
        /** sig90_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig90_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func90_in_sel_cfg_reg_t;

/** Type of func91_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func91_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func91_in_sel:6;
        /** func91_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func91_in_inv_sel:1;
        /** sig91_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig91_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func91_in_sel_cfg_reg_t;

/** Type of func92_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func92_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func92_in_sel:6;
        /** func92_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func92_in_inv_sel:1;
        /** sig92_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig92_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func92_in_sel_cfg_reg_t;

