espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func93_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func93_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func93_in_sel:6;
        /** func93_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func93_in_inv_sel:1;
        /** sig93_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig93_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func93_in_sel_cfg_reg_t;

/** Type of func94_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func94_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func94_in_sel:6;
        /** func94_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func94_in_inv_sel:1;
        /** sig94_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig94_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func94_in_sel_cfg_reg_t;

/** Type of func95_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func95_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func95_in_sel:6;
        /** func95_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func95_in_inv_sel:1;
        /** sig95_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig95_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func95_in_sel_cfg_reg_t;

/** Type of func97_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func97_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func97_in_sel:6;
        /** func97_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func97_in_inv_sel:1;
        /** sig97_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig97_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func97_in_sel_cfg_reg_t;

/** Type of func98_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func98_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func98_in_sel:6;
        /** func98_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func98_in_inv_sel:1;
        /** sig98_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig98_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func98_in_sel_cfg_reg_t;

/** Type of func99_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func99_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func99_in_sel:6;
        /** func99_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func99_in_inv_sel:1;
        /** sig99_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig99_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func99_in_sel_cfg_reg_t;

/** Type of func100_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func100_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func100_in_sel:6;
        /** func100_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func100_in_inv_sel:1;
        /** sig100_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig100_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func100_in_sel_cfg_reg_t;

/** Type of func101_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func101_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func101_in_sel:6;
        /** func101_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func101_in_inv_sel:1;
        /** sig101_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig101_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func101_in_sel_cfg_reg_t;

