espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func112_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func112_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func112_in_sel:6;
        /** func112_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func112_in_inv_sel:1;
        /** sig112_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig112_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func112_in_sel_cfg_reg_t;

/** Type of func113_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func113_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func113_in_sel:6;
        /** func113_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func113_in_inv_sel:1;
        /** sig113_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig113_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func113_in_sel_cfg_reg_t;

/** Type of func114_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func114_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func114_in_sel:6;
        /** func114_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func114_in_inv_sel:1;
        /** sig114_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig114_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func114_in_sel_cfg_reg_t;

/** Type of func115_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func115_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func115_in_sel:6;
        /** func115_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func115_in_inv_sel:1;
        /** sig115_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig115_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func115_in_sel_cfg_reg_t;

/** Type of func116_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func116_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func116_in_sel:6;
        /** func116_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func116_in_inv_sel:1;
        /** sig116_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig116_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func116_in_sel_cfg_reg_t;

/** Type of func117_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func117_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func117_in_sel:6;
        /** func117_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func117_in_inv_sel:1;
        /** sig117_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig117_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func117_in_sel_cfg_reg_t;

/** Type of func118_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func118_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func118_in_sel:6;
        /** func118_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func118_in_inv_sel:1;
        /** sig118_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig118_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func118_in_sel_cfg_reg_t;

/** Type of func119_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func119_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func119_in_sel:6;
        /** func119_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func119_in_inv_sel:1;
        /** sig119_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig119_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func119_in_sel_cfg_reg_t;

/** Type of func120_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func120_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func120_in_sel:6;
        /** func120_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func120_in_inv_sel:1;
        /** sig120_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig120_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func120_in_sel_cfg_reg_t;

/** Type of func121_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func121_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func121_in_sel:6;
        /** func121_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func121_in_inv_sel:1;
        /** sig121_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig121_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func121_in_sel_cfg_reg_t;

