espressif/esp-idf/components/soc/esp32c5/include/soc/gpio_struct.h
/** Type of func122_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func122_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func122_in_sel:6;
        /** func122_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func122_in_inv_sel:1;
        /** sig122_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig122_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func122_in_sel_cfg_reg_t;

/** Type of func123_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func123_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func123_in_sel:6;
        /** func123_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func123_in_inv_sel:1;
        /** sig123_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig123_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func123_in_sel_cfg_reg_t;

/** Type of func124_in_sel_cfg register
 *  GPIO input function configuration register
 */
typedef union {
    struct {
        /** func124_in_sel : R/W; bitpos: [5:0]; default: 60;
         *  set this value: s=0-34: connect GPIO[s] to this port. s=0x38: set this port always
         *  high level. s=0x3C: set this port always low level.
         */
        uint32_t func124_in_sel:6;
        /** func124_in_inv_sel : R/W; bitpos: [6]; default: 0;
         *  set this bit to invert input signal. 1:invert. 0:not invert.
         */
        uint32_t func124_in_inv_sel:1;
        /** sig124_in_sel : R/W; bitpos: [7]; default: 0;
         *  set this bit to bypass GPIO. 1:do not bypass GPIO. 0:bypass GPIO.
         */
        uint32_t sig124_in_sel:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} gpio_func124_in_sel_cfg_reg_t;

/** Type of funcn_out_sel_cfg register
 *  GPIO output function select register
 */
typedef union {
    struct {
        /** funcn_out_sel : R/W/SC; bitpos: [7:0]; default: 128;
         *  The value of the bits: 0<=s<=256. Set the value to select output signal. s=0-127:
         *  output of GPIO[n] equals input of peripheral[s]. s=128: output of GPIO[n] equals
         *  GPIO_OUT_REG[n].
         */
        uint32_t funcn_out_sel:8;
        /** funcn_out_inv_sel : R/W/SC; bitpos: [8]; default: 0;
         *  set this bit to invert output signal.1:invert.0:not invert.
         */
        uint32_t funcn_out_inv_sel:1;
        /** funcn_oen_sel : R/W; bitpos: [9]; default: 0;
         *  set this bit to select output enable signal.1:use GPIO_ENABLE_REG[n] as output
         *  enable signal.0:use peripheral output enable signal.
         */
        uint32_t funcn_oen_sel:1;
        /** funcn_oen_inv_sel : R/W; bitpos: [10]; default: 0;
         *  set this bit to invert output enable signal.1:invert.0:not invert.
         */
        uint32_t funcn_oen_inv_sel:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} gpio_funcn_out_sel_cfg_reg_t;

/** Type of clock_gate register
 *  GPIO clock gate register
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 1;
         *  set this bit to enable GPIO clock gate
         */
        uint32_t clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} gpio_clock_gate_reg_t;

/** Type of date register
 *  GPIO version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 36704512;
         *  version register
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} gpio_date_reg_t;


typedef struct gpio_dev_t {
    volatile gpio_bt_select_reg_t bt_select;
    volatile gpio_out_reg_t out;
    volatile gpio_out_w1ts_reg_t out_w1ts;
    volatile gpio_out_w1tc_reg_t out_w1tc;
    uint32_t reserved_010[3];
    volatile gpio_sdio_select_reg_t sdio_select;
    volatile gpio_enable_reg_t enable;
    volatile gpio_enable_w1ts_reg_t enable_w1ts;
    volatile gpio_enable_w1tc_reg_t enable_w1tc;
    uint32_t reserved_02c[3];
    volatile gpio_strap_reg_t strap;
    volatile gpio_in_reg_t in;
    uint32_t reserved_040;
    volatile gpio_status_reg_t status;
    volatile gpio_status_w1ts_reg_t status_w1ts;
    volatile gpio_status_w1tc_reg_t status_w1tc;
    uint32_t reserved_050[3];
    volatile gpio_pcpu_int_reg_t pcpu_int;
    volatile gpio_pcpu_nmi_int_reg_t pcpu_nmi_int;
    volatile gpio_cpusdio_int_reg_t cpusdio_int;
    uint32_t reserved_068[3];
    volatile gpio_pinn_reg_t pinn[31];
    uint32_t reserved_0f0[23];
    volatile gpio_status_next_reg_t status_next;
    uint32_t reserved_150;
    volatile gpio_func0_in_sel_cfg_reg_t func0_in_sel_cfg;
    uint32_t reserved_158[5];
    volatile gpio_func6_in_sel_cfg_reg_t func6_in_sel_cfg;
    volatile gpio_func7_in_sel_cfg_reg_t func7_in_sel_cfg;
    volatile gpio_func8_in_sel_cfg_reg_t func8_in_sel_cfg;
    volatile gpio_func9_in_sel_cfg_reg_t func9_in_sel_cfg;
    volatile gpio_func10_in_sel_cfg_reg_t func10_in_sel_cfg;
    volatile gpio_func11_in_sel_cfg_reg_t func11_in_sel_cfg;
    volatile gpio_func12_in_sel_cfg_reg_t func12_in_sel_cfg;
    volatile gpio_func13_in_sel_cfg_reg_t func13_in_sel_cfg;
    volatile gpio_func14_in_sel_cfg_reg_t func14_in_sel_cfg;
    volatile gpio_func15_in_sel_cfg_reg_t func15_in_sel_cfg;
    volatile gpio_func16_in_sel_cfg_reg_t func16_in_sel_cfg;
    volatile gpio_func17_in_sel_cfg_reg_t func17_in_sel_cfg;
    uint32_t reserved_19c;
    volatile gpio_func19_in_sel_cfg_reg_t func19_in_sel_cfg;
    uint32_t reserved_1a4;
    volatile gpio_func21_in_sel_cfg_reg_t func21_in_sel_cfg;
    volatile gpio_func22_in_sel_cfg_reg_t func22_in_sel_cfg;
    volatile gpio_func23_in_sel_cfg_reg_t func23_in_sel_cfg;
    volatile gpio_func24_in_sel_cfg_reg_t func24_in_sel_cfg;
    uint32_t reserved_1b8[3];
    volatile gpio_func28_in_sel_cfg_reg_t func28_in_sel_cfg;
    volatile gpio_func29_in_sel_cfg_reg_t func29_in_sel_cfg;
    volatile gpio_func30_in_sel_cfg_reg_t func30_in_sel_cfg;
    volatile gpio_func31_in_sel_cfg_reg_t func31_in_sel_cfg;
    volatile gpio_func32_in_sel_cfg_reg_t func32_in_sel_cfg;
    volatile gpio_func33_in_sel_cfg_reg_t func33_in_sel_cfg;
    volatile gpio_func34_in_sel_cfg_reg_t func34_in_sel_cfg;
    volatile gpio_func35_in_sel_cfg_reg_t func35_in_sel_cfg;
    uint32_t reserved_1e4[4];
    volatile gpio_func40_in_sel_cfg_reg_t func40_in_sel_cfg;
    volatile gpio_func41_in_sel_cfg_reg_t func41_in_sel_cfg;
    volatile gpio_func42_in_sel_cfg_reg_t func42_in_sel_cfg;
    uint32_t reserved_200[2];
    volatile gpio_func45_in_sel_cfg_reg_t func45_in_sel_cfg;
    volatile gpio_func46_in_sel_cfg_reg_t func46_in_sel_cfg;
    volatile gpio_func47_in_sel_cfg_reg_t func47_in_sel_cfg;
    volatile gpio_func48_in_sel_cfg_reg_t func48_in_sel_cfg;
    volatile gpio_func49_in_sel_cfg_reg_t func49_in_sel_cfg;
    volatile gpio_func50_in_sel_cfg_reg_t func50_in_sel_cfg;
    volatile gpio_func51_in_sel_cfg_reg_t func51_in_sel_cfg;
    volatile gpio_func52_in_sel_cfg_reg_t func52_in_sel_cfg;
    volatile gpio_func53_in_sel_cfg_reg_t func53_in_sel_cfg;
    volatile gpio_func54_in_sel_cfg_reg_t func54_in_sel_cfg;
    uint32_t reserved_230[8];
    volatile gpio_func63_in_sel_cfg_reg_t func63_in_sel_cfg;
    volatile gpio_func64_in_sel_cfg_reg_t func64_in_sel_cfg;
    volatile gpio_func65_in_sel_cfg_reg_t func65_in_sel_cfg;
    volatile gpio_func66_in_sel_cfg_reg_t func66_in_sel_cfg;
    volatile gpio_func67_in_sel_cfg_reg_t func67_in_sel_cfg;
    volatile gpio_func68_in_sel_cfg_reg_t func68_in_sel_cfg;
    volatile gpio_func69_in_sel_cfg_reg_t func69_in_sel_cfg;
    volatile gpio_func70_in_sel_cfg_reg_t func70_in_sel_cfg;
    volatile gpio_func71_in_sel_cfg_reg_t func71_in_sel_cfg;
    volatile gpio_func72_in_sel_cfg_reg_t func72_in_sel_cfg;
    volatile gpio_func73_in_sel_cfg_reg_t func73_in_sel_cfg;
    uint32_t reserved_27c[3];
    volatile gpio_func77_in_sel_cfg_reg_t func77_in_sel_cfg;
    uint32_t reserved_28c[3];
    volatile gpio_func81_in_sel_cfg_reg_t func81_in_sel_cfg;
    volatile gpio_func82_in_sel_cfg_reg_t func82_in_sel_cfg;
    volatile gpio_func83_in_sel_cfg_reg_t func83_in_sel_cfg;
    volatile gpio_func84_in_sel_cfg_reg_t func84_in_sel_cfg;
    volatile gpio_func85_in_sel_cfg_reg_t func85_in_sel_cfg;
    volatile gpio_func86_in_sel_cfg_reg_t func86_in_sel_cfg;
    volatile gpio_func87_in_sel_cfg_reg_t func87_in_sel_cfg;
    volatile gpio_func88_in_sel_cfg_reg_t func88_in_sel_cfg;
    volatile gpio_func89_in_sel_cfg_reg_t func89_in_sel_cfg;
    volatile gpio_func90_in_sel_cfg_reg_t func90_in_sel_cfg;
    volatile gpio_func91_in_sel_cfg_reg_t func91_in_sel_cfg;
    volatile gpio_func92_in_sel_cfg_reg_t func92_in_sel_cfg;
    volatile gpio_func93_in_sel_cfg_reg_t func93_in_sel_cfg;
    volatile gpio_func94_in_sel_cfg_reg_t func94_in_sel_cfg;
    volatile gpio_func95_in_sel_cfg_reg_t func95_in_sel_cfg;
    uint32_t reserved_2d4;
    volatile gpio_func97_in_sel_cfg_reg_t func97_in_sel_cfg;
    volatile gpio_func98_in_sel_cfg_reg_t func98_in_sel_cfg;
    volatile gpio_func99_in_sel_cfg_reg_t func99_in_sel_cfg;
    volatile gpio_func100_in_sel_cfg_reg_t func100_in_sel_cfg;
    volatile gpio_func101_in_sel_cfg_reg_t func101_in_sel_cfg;
    volatile gpio_func102_in_sel_cfg_reg_t func102_in_sel_cfg;
    volatile gpio_func103_in_sel_cfg_reg_t func103_in_sel_cfg;
    volatile gpio_func104_in_sel_cfg_reg_t func104_in_sel_cfg;
    volatile gpio_func105_in_sel_cfg_reg_t func105_in_sel_cfg;
    volatile gpio_func106_in_sel_cfg_reg_t func106_in_sel_cfg;
    volatile gpio_func107_in_sel_cfg_reg_t func107_in_sel_cfg;
    volatile gpio_func108_in_sel_cfg_reg_t func108_in_sel_cfg;
    volatile gpio_func109_in_sel_cfg_reg_t func109_in_sel_cfg;
    volatile gpio_func110_in_sel_cfg_reg_t func110_in_sel_cfg;
    volatile gpio_func111_in_sel_cfg_reg_t func111_in_sel_cfg;
    volatile gpio_func112_in_sel_cfg_reg_t func112_in_sel_cfg;
    volatile gpio_func113_in_sel_cfg_reg_t func113_in_sel_cfg;
    volatile gpio_func114_in_sel_cfg_reg_t func114_in_sel_cfg;
    volatile gpio_func115_in_sel_cfg_reg_t func115_in_sel_cfg;
    volatile gpio_func116_in_sel_cfg_reg_t func116_in_sel_cfg;
    volatile gpio_func117_in_sel_cfg_reg_t func117_in_sel_cfg;
    volatile gpio_func118_in_sel_cfg_reg_t func118_in_sel_cfg;
    volatile gpio_func119_in_sel_cfg_reg_t func119_in_sel_cfg;
    volatile gpio_func120_in_sel_cfg_reg_t func120_in_sel_cfg;
    volatile gpio_func121_in_sel_cfg_reg_t func121_in_sel_cfg;
    volatile gpio_func122_in_sel_cfg_reg_t func122_in_sel_cfg;
    volatile gpio_func123_in_sel_cfg_reg_t func123_in_sel_cfg;
    volatile gpio_func124_in_sel_cfg_reg_t func124_in_sel_cfg;
    uint32_t reserved_348[131];
    volatile gpio_funcn_out_sel_cfg_reg_t funcn_out_sel_cfg[31];
    uint32_t reserved_5d0[23];
    volatile gpio_clock_gate_reg_t clock_gate;
    uint32_t reserved_630[51];
    volatile gpio_date_reg_t date;
} gpio_dev_t;

extern gpio_dev_t GPIO;

#ifndef __cplusplus
_Static_assert(sizeof(gpio_dev_t) == 0x700, "Invalid size of gpio_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
